- DataFrame은 2차원배열 같은 자료구조
- R언어 data.frame 과 비슷하다.

In [25]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np

In [3]:
a = pd.DataFrame([
    [1,2,3],
    [4,5,6],
    [7,8,9]
])
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [7]:
data = {
    'city' : ['서울','부산','광주','대구'],
    'year' : [2000,2001,2002,2002],
    'pop'  : [4000,2000,1000,1000]
}

df = DataFrame(data)
df

  city   pop  year
0   서울  4000  2000
1   부산  2000  2001
2   광주  1000  2002
3   대구  1000  2002

In [9]:
df = DataFrame(data, columns = ['year', 'city', 'pop'])
df

   year city   pop
0  2000   서울  4000
1  2001   부산  2000
2  2002   광주  1000
3  2002   대구  1000

In [12]:
df2 = DataFrame(data, 
                columns=['year', 'city', 'pop', 'debt'], 
                index=['one','two','three','four'])
df2

       year city   pop debt
one    2000   서울  4000  NaN
two    2001   부산  2000  NaN
three  2002   광주  1000  NaN
four   2002   대구  1000  NaN

In [15]:
df2['city']

one      서울
two      부산
three    광주
four     대구
Name: city, dtype: object

In [16]:
df2['year']

one      2000
two      2001
three    2002
four     2002
Name: year, dtype: int64

In [18]:
df2.columns

Index(['year', 'city', 'pop', 'debt'], dtype='object')

In [19]:
df2.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [23]:
df2.loc['three'] #ix : 로우의 위치 접근할 때 사용하는 메소드
                 #ix는 색인을 name속성의 값으로 할당한다.

year    2002
city      광주
pop     1000
debt     NaN
Name: three, dtype: object

In [24]:
df2['debt'] = 1000
df2

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  1000
three  2002   광주  1000  1000
four   2002   대구  1000  1000

In [38]:
df2['debt'] = np.arange(1000,5000,1000)
df2

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000

In [37]:
val = Series([1000,2000,3000,4000],index=['one','two','three','four'])
df2['debt'] = val
df2

       year city   pop  debt
one    2000   서울  4000  1000
two    2001   부산  2000  2000
three  2002   광주  1000  3000
four   2002   대구  1000  4000

In [40]:
val1 = Series([1000,3000,5000], index = ['one', 'three', 'four'])
df2['debt'] = val1
df2

       year city   pop    debt
one    2000   서울  4000  1000.0
two    2001   부산  2000     NaN
three  2002   광주  1000  3000.0
four   2002   대구  1000  5000.0

In [44]:
df2['aaa'] = df2.city == '서울'
df2

       year city   pop    debt    aaa
one    2000   서울  4000  1000.0   True
two    2001   부산  2000     NaN  False
three  2002   광주  1000  3000.0  False
four   2002   대구  1000  5000.0  False

In [45]:
del df2['aaa']
df2

       year city   pop    debt
one    2000   서울  4000  1000.0
two    2001   부산  2000     NaN
three  2002   광주  1000  3000.0
four   2002   대구  1000  5000.0

In [46]:
data2 = {
    'Seoul' : {2001:20, 2002:30},
    'Busan' : {2000:10, 2001:20, 2002:300}
}
df3 = DataFrame(data2)
df3

      Busan  Seoul
2000     10    NaN
2001     20   20.0
2002    300   30.0

In [47]:
df3.T

       2000  2001   2002
Busan  10.0  20.0  300.0
Seoul   NaN  20.0   30.0

In [49]:
df3.values #DataFrame에서 values 속성은 저장된 데이터를 2차원 배열로 리턴

array([[ 10.,  nan],
       [ 20.,  20.],
       [300.,  30.]])